Practice Notebook!

In [24]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
# use Tech_Gaints.xlsx

# Reading a file

      # reading  a file with column titles
      # can be used for skipping the rows,
                                            
                # header = 0, it is default
                # if header = 1 then first row become title
       
                # to read nunber of n number of rows

          # it makes null value, key == column name
          # value == to make it null

     Tickers   Eps  Revenue   Price         Peaple
0     Google  27.8       87   845.0     larry page
1   WallMart   4.6      484    65.0            NaN
2  Mircosoft  -1.0       85    64.0     bill gates
3   Reliance   NaN       50  1023.0  mukesh ambani
4       Tata   5.6       -1     NaN     ratan tata

In [26]:
# Now Writing into a file.( to_csv())

# index = False : now default index will not be visible on the file,
# columns =['index', 'firstName', 'lastName'] :  only these columns will visile on new file,
# header = False : column title will not be visible

# To Attach N Sheets in Excel sheet

In [29]:
# Use ExcelWriter function in pandas.